{
    "backbone_weight_path": "/gpfs/home/dvliet/MoE_RAG_Classifier/Models/DactBert/DefaultWeights/backbone_weights_tuned.bin",
    "classifier_config": {
        "num_layers": 5,
        "hidden_units": 768,
        "dropout": 0.4,
        "use_batch_norm": true,
        "activation": "LeakyReLU"
    },
    "confidence_config": {
        "num_layers": 2,
        "hidden_units": 256,
        "dropout": 0.2,
        "use_batch_norm": false,
        "activation": "LeakyReLU"
    },
    "output_dimension": 3,
    "distilbert_config": {
        "vocab_size": 30522,
        "max_position_embeddings": 512,
        "sinusoidal_pos_embds": false,
        "n_layers": 6,
        "n_heads": 12,
        "dim": 768,
        "hidden_dim": 3072,
        "dropout": 0.1,
        "attention_dropout": 0.1,
        "activation": "gelu",
        "initializer_range": 0.02,
        "qa_dropout": 0.1,
        "seq_classif_dropout": 0.2,
        "return_dict": true,
        "output_hidden_states": true,
        "output_attentions": false,
        "torchscript": false,
        "torch_dtype": null,
        "use_bfloat16": false,
        "tf_legacy_loss": false,
        "pruned_heads": {},
        "tie_word_embeddings": true,
        "chunk_size_feed_forward": 0,
        "is_encoder_decoder": false,
        "is_decoder": false,
        "cross_attention_hidden_size": null,
        "add_cross_attention": false,
        "tie_encoder_decoder": false,
        "max_length": 20,
        "min_length": 0,
        "do_sample": false,
        "early_stopping": false,
        "num_beams": 1,
        "num_beam_groups": 1,
        "diversity_penalty": 0.0,
        "temperature": 1.0,
        "top_k": 50,
        "top_p": 1.0,
        "typical_p": 1.0,
        "repetition_penalty": 1.0,
        "length_penalty": 1.0,
        "no_repeat_ngram_size": 0,
        "encoder_no_repeat_ngram_size": 0,
        "bad_words_ids": null,
        "num_return_sequences": 1,
        "output_scores": false,
        "return_dict_in_generate": false,
        "forced_bos_token_id": null,
        "forced_eos_token_id": null,
        "remove_invalid_values": false,
        "exponential_decay_length_penalty": null,
        "suppress_tokens": null,
        "begin_suppress_tokens": null,
        "architectures": [
            "DistilBertForMaskedLM"
        ],
        "finetuning_task": null,
        "id2label": {
            "0": "LABEL_0",
            "1": "LABEL_1"
        },
        "label2id": {
            "LABEL_0": 0,
            "LABEL_1": 1
        },
        "tokenizer_class": null,
        "prefix": null,
        "bos_token_id": null,
        "pad_token_id": 0,
        "eos_token_id": null,
        "sep_token_id": null,
        "decoder_start_token_id": null,
        "task_specific_params": null,
        "problem_type": null,
        "_name_or_path": "",
        "_attn_implementation_autoset": false,
        "transformers_version": "4.49.0",
        "model_type": "distilbert",
        "tie_weights_": true
    },
    "pretrained_weights": "/gpfs/home/dvliet/MoE_RAG_Classifier/Models/DactBert/Weights/dact_bert_weights_TUNED.bin"
}